Microchip-MPLAB-Harmony/csp/apps/mcan/mcan_normal_operation_blocking/firmware/src/packs/ATSAMA5D27_DFP/component/spi.h
/* -------- SPI_RDR : (SPI Offset: 0x08) ( R/ 32) Receive Data Register -------- */
#define SPI_RDR_RD_Pos                        _U_(0)                                               /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_RD_Msk                        (_U_(0xFFFF) << SPI_RDR_RD_Pos)                      /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_RD(value)                     (SPI_RDR_RD_Msk & ((value) << SPI_RDR_RD_Pos))      
#define SPI_RDR_PCS_Pos                       _U_(16)                                              /**< (SPI_RDR) Peripheral Chip Select Position */
#define SPI_RDR_PCS_Msk                       (_U_(0xF) << SPI_RDR_PCS_Pos)                        /**< (SPI_RDR) Peripheral Chip Select Mask */
#define SPI_RDR_PCS(value)                    (SPI_RDR_PCS_Msk & ((value) << SPI_RDR_PCS_Pos))    
#define SPI_RDR_Msk                           _U_(0x000FFFFF)                                      /**< (SPI_RDR) Register Mask  */

/* FIFO_MULTI_DATA_8 mode */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_0_Pos   _U_(0)                                               /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_0_Msk   (_U_(0xFF) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_0_Pos)   /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_0(value) (SPI_RDR_FIFO_MULTI_DATA_8_RD8_0_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_0_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_1_Pos   _U_(8)                                               /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_1_Msk   (_U_(0xFF) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_1_Pos)   /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_1(value) (SPI_RDR_FIFO_MULTI_DATA_8_RD8_1_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_1_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_2_Pos   _U_(16)                                              /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_2_Msk   (_U_(0xFF) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_2_Pos)   /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_2(value) (SPI_RDR_FIFO_MULTI_DATA_8_RD8_2_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_2_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_3_Pos   _U_(24)                                              /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_3_Msk   (_U_(0xFF) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_3_Pos)   /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_8_RD8_3(value) (SPI_RDR_FIFO_MULTI_DATA_8_RD8_3_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_8_RD8_3_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_8_Msk         _U_(0xFFFFFFFF)                                       /**< (SPI_RDR_FIFO_MULTI_DATA_8) Register Mask  */

/* FIFO_MULTI_DATA_16 mode */
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_0_Pos _U_(0)                                               /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_0_Msk (_U_(0xFFFF) << SPI_RDR_FIFO_MULTI_DATA_16_RD16_0_Pos) /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_0(value) (SPI_RDR_FIFO_MULTI_DATA_16_RD16_0_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_16_RD16_0_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_1_Pos _U_(16)                                              /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_1_Msk (_U_(0xFFFF) << SPI_RDR_FIFO_MULTI_DATA_16_RD16_1_Pos) /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_FIFO_MULTI_DATA_16_RD16_1(value) (SPI_RDR_FIFO_MULTI_DATA_16_RD16_1_Msk & ((value) << SPI_RDR_FIFO_MULTI_DATA_16_RD16_1_Pos))
#define SPI_RDR_FIFO_MULTI_DATA_16_Msk        _U_(0xFFFFFFFF)                                       /**< (SPI_RDR_FIFO_MULTI_DATA_16) Register Mask  */


/* -------- SPI_TDR : (SPI Offset: 0x0C) ( /W 32) Transmit Data Register -------- */
#define SPI_TDR_TD_Pos                        _U_(0)                                               /**< (SPI_TDR) Transmit Data Position */
#define SPI_TDR_TD_Msk                        (_U_(0xFFFF) << SPI_TDR_TD_Pos)                      /**< (SPI_TDR) Transmit Data Mask */
#define SPI_TDR_TD(value)                     (SPI_TDR_TD_Msk & ((value) << SPI_TDR_TD_Pos))      
#define SPI_TDR_PCS_Pos                       _U_(16)                                              /**< (SPI_TDR) Peripheral Chip Select Position */
#define SPI_TDR_PCS_Msk                       (_U_(0xF) << SPI_TDR_PCS_Pos)                        /**< (SPI_TDR) Peripheral Chip Select Mask */
#define SPI_TDR_PCS(value)                    (SPI_TDR_PCS_Msk & ((value) << SPI_TDR_PCS_Pos))    
#define   SPI_TDR_PCS_NPCS0_Val               _U_(0xE)                                             /**< (SPI_TDR) NPCS0 as Chip Select  */
#define   SPI_TDR_PCS_NPCS1_Val               _U_(0xD)                                             /**< (SPI_TDR) NPCS1 as Chip Select  */
#define   SPI_TDR_PCS_NPCS2_Val               _U_(0xB)                                             /**< (SPI_TDR) NPCS2 as Chip Select  */
#define   SPI_TDR_PCS_NPCS3_Val               _U_(0x7)                                             /**< (SPI_TDR) NPCS3 as Chip Select  */
#define SPI_TDR_PCS_NPCS0                     (SPI_TDR_PCS_NPCS0_Val << SPI_TDR_PCS_Pos)           /**< (SPI_TDR) NPCS0 as Chip Select Position  */
#define SPI_TDR_PCS_NPCS1                     (SPI_TDR_PCS_NPCS1_Val << SPI_TDR_PCS_Pos)           /**< (SPI_TDR) NPCS1 as Chip Select Position  */
#define SPI_TDR_PCS_NPCS2                     (SPI_TDR_PCS_NPCS2_Val << SPI_TDR_PCS_Pos)           /**< (SPI_TDR) NPCS2 as Chip Select Position  */
#define SPI_TDR_PCS_NPCS3                     (SPI_TDR_PCS_NPCS3_Val << SPI_TDR_PCS_Pos)           /**< (SPI_TDR) NPCS3 as Chip Select Position  */
#define SPI_TDR_LASTXFER_Pos                  _U_(24)                                              /**< (SPI_TDR) Last Transfer Position */
#define SPI_TDR_LASTXFER_Msk                  (_U_(0x1) << SPI_TDR_LASTXFER_Pos)                   /**< (SPI_TDR) Last Transfer Mask */
#define SPI_TDR_LASTXFER(value)               (SPI_TDR_LASTXFER_Msk & ((value) << SPI_TDR_LASTXFER_Pos))
#define SPI_TDR_Msk                           _U_(0x010FFFFF)                                      /**< (SPI_TDR) Register Mask  */

/* FIFO_MULTI_DATA mode */
#define SPI_TDR_FIFO_MULTI_DATA_TD0_Pos       _U_(0)                                               /**< (SPI_TDR) Transmit Data Position */
#define SPI_TDR_FIFO_MULTI_DATA_TD0_Msk       (_U_(0xFFFF) << SPI_TDR_FIFO_MULTI_DATA_TD0_Pos)     /**< (SPI_TDR) Transmit Data Mask */
#define SPI_TDR_FIFO_MULTI_DATA_TD0(value)    (SPI_TDR_FIFO_MULTI_DATA_TD0_Msk & ((value) << SPI_TDR_FIFO_MULTI_DATA_TD0_Pos))
#define SPI_TDR_FIFO_MULTI_DATA_TD1_Pos       _U_(16)                                              /**< (SPI_TDR) Transmit Data Position */
#define SPI_TDR_FIFO_MULTI_DATA_TD1_Msk       (_U_(0xFFFF) << SPI_TDR_FIFO_MULTI_DATA_TD1_Pos)     /**< (SPI_TDR) Transmit Data Mask */
#define SPI_TDR_FIFO_MULTI_DATA_TD1(value)    (SPI_TDR_FIFO_MULTI_DATA_TD1_Msk & ((value) << SPI_TDR_FIFO_MULTI_DATA_TD1_Pos))
#define SPI_TDR_FIFO_MULTI_DATA_Msk           _U_(0xFFFFFFFF)                                       /**< (SPI_TDR_FIFO_MULTI_DATA) Register Mask  */


/* -------- SPI_SR : (SPI Offset: 0x10) ( R/ 32) Status Register -------- */
#define SPI_SR_RDRF_Pos                       _U_(0)                                               /**< (SPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Position */
#define SPI_SR_RDRF_Msk                       (_U_(0x1) << SPI_SR_RDRF_Pos)                        /**< (SPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Mask */
#define SPI_SR_RDRF(value)                    (SPI_SR_RDRF_Msk & ((value) << SPI_SR_RDRF_Pos))    
#define SPI_SR_TDRE_Pos                       _U_(1)                                               /**< (SPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Position */
#define SPI_SR_TDRE_Msk                       (_U_(0x1) << SPI_SR_TDRE_Pos)                        /**< (SPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Mask */
#define SPI_SR_TDRE(value)                    (SPI_SR_TDRE_Msk & ((value) << SPI_SR_TDRE_Pos))    
#define SPI_SR_MODF_Pos                       _U_(2)                                               /**< (SPI_SR) Mode Fault Error (cleared on read) Position */
#define SPI_SR_MODF_Msk                       (_U_(0x1) << SPI_SR_MODF_Pos)                        /**< (SPI_SR) Mode Fault Error (cleared on read) Mask */
#define SPI_SR_MODF(value)                    (SPI_SR_MODF_Msk & ((value) << SPI_SR_MODF_Pos))    
#define SPI_SR_OVRES_Pos                      _U_(3)                                               /**< (SPI_SR) Overrun Error Status (cleared on read) Position */
#define SPI_SR_OVRES_Msk                      (_U_(0x1) << SPI_SR_OVRES_Pos)                       /**< (SPI_SR) Overrun Error Status (cleared on read) Mask */
#define SPI_SR_OVRES(value)                   (SPI_SR_OVRES_Msk & ((value) << SPI_SR_OVRES_Pos))  
#define SPI_SR_NSSR_Pos                       _U_(8)                                               /**< (SPI_SR) NSS Rising (cleared on read) Position */
#define SPI_SR_NSSR_Msk                       (_U_(0x1) << SPI_SR_NSSR_Pos)                        /**< (SPI_SR) NSS Rising (cleared on read) Mask */
#define SPI_SR_NSSR(value)                    (SPI_SR_NSSR_Msk & ((value) << SPI_SR_NSSR_Pos))    
#define SPI_SR_TXEMPTY_Pos                    _U_(9)                                               /**< (SPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Position */
#define SPI_SR_TXEMPTY_Msk                    (_U_(0x1) << SPI_SR_TXEMPTY_Pos)                     /**< (SPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Mask */
#define SPI_SR_TXEMPTY(value)                 (SPI_SR_TXEMPTY_Msk & ((value) << SPI_SR_TXEMPTY_Pos))
#define SPI_SR_UNDES_Pos                      _U_(10)                                              /**< (SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Position */
#define SPI_SR_UNDES_Msk                      (_U_(0x1) << SPI_SR_UNDES_Pos)                       /**< (SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Mask */
#define SPI_SR_UNDES(value)                   (SPI_SR_UNDES_Msk & ((value) << SPI_SR_UNDES_Pos))  
#define SPI_SR_CMP_Pos                        _U_(11)                                              /**< (SPI_SR) Comparison Status (cleared on read) Position */
#define SPI_SR_CMP_Msk                        (_U_(0x1) << SPI_SR_CMP_Pos)                         /**< (SPI_SR) Comparison Status (cleared on read) Mask */
#define SPI_SR_CMP(value)                     (SPI_SR_CMP_Msk & ((value) << SPI_SR_CMP_Pos))      
#define SPI_SR_SPIENS_Pos                     _U_(16)                                              /**< (SPI_SR) SPI Enable Status Position */
#define SPI_SR_SPIENS_Msk                     (_U_(0x1) << SPI_SR_SPIENS_Pos)                      /**< (SPI_SR) SPI Enable Status Mask */
#define SPI_SR_SPIENS(value)                  (SPI_SR_SPIENS_Msk & ((value) << SPI_SR_SPIENS_Pos))
#define SPI_SR_TXFEF_Pos                      _U_(24)                                              /**< (SPI_SR) Transmit FIFO Empty Flag (cleared on read) Position */
#define SPI_SR_TXFEF_Msk                      (_U_(0x1) << SPI_SR_TXFEF_Pos)                       /**< (SPI_SR) Transmit FIFO Empty Flag (cleared on read) Mask */
#define SPI_SR_TXFEF(value)                   (SPI_SR_TXFEF_Msk & ((value) << SPI_SR_TXFEF_Pos))  
#define SPI_SR_TXFFF_Pos                      _U_(25)                                              /**< (SPI_SR) Transmit FIFO Full Flag (cleared on read) Position */
#define SPI_SR_TXFFF_Msk                      (_U_(0x1) << SPI_SR_TXFFF_Pos)                       /**< (SPI_SR) Transmit FIFO Full Flag (cleared on read) Mask */
#define SPI_SR_TXFFF(value)                   (SPI_SR_TXFFF_Msk & ((value) << SPI_SR_TXFFF_Pos))  
#define SPI_SR_TXFTHF_Pos                     _U_(26)                                              /**< (SPI_SR) Transmit FIFO Threshold Flag (cleared on read) Position */
#define SPI_SR_TXFTHF_Msk                     (_U_(0x1) << SPI_SR_TXFTHF_Pos)                      /**< (SPI_SR) Transmit FIFO Threshold Flag (cleared on read) Mask */
#define SPI_SR_TXFTHF(value)                  (SPI_SR_TXFTHF_Msk & ((value) << SPI_SR_TXFTHF_Pos))
#define SPI_SR_RXFEF_Pos                      _U_(27)                                              /**< (SPI_SR) Receive FIFO Empty Flag Position */
#define SPI_SR_RXFEF_Msk                      (_U_(0x1) << SPI_SR_RXFEF_Pos)                       /**< (SPI_SR) Receive FIFO Empty Flag Mask */
#define SPI_SR_RXFEF(value)                   (SPI_SR_RXFEF_Msk & ((value) << SPI_SR_RXFEF_Pos))  
#define SPI_SR_RXFFF_Pos                      _U_(28)                                              /**< (SPI_SR) Receive FIFO Full Flag Position */
#define SPI_SR_RXFFF_Msk                      (_U_(0x1) << SPI_SR_RXFFF_Pos)                       /**< (SPI_SR) Receive FIFO Full Flag Mask */
#define SPI_SR_RXFFF(value)                   (SPI_SR_RXFFF_Msk & ((value) << SPI_SR_RXFFF_Pos))  
#define SPI_SR_RXFTHF_Pos                     _U_(29)                                              /**< (SPI_SR) Receive FIFO Threshold Flag Position */
#define SPI_SR_RXFTHF_Msk                     (_U_(0x1) << SPI_SR_RXFTHF_Pos)                      /**< (SPI_SR) Receive FIFO Threshold Flag Mask */
#define SPI_SR_RXFTHF(value)                  (SPI_SR_RXFTHF_Msk & ((value) << SPI_SR_RXFTHF_Pos))
#define SPI_SR_TXFPTEF_Pos                    _U_(30)                                              /**< (SPI_SR) Transmit FIFO Pointer Error Flag Position */
#define SPI_SR_TXFPTEF_Msk                    (_U_(0x1) << SPI_SR_TXFPTEF_Pos)                     /**< (SPI_SR) Transmit FIFO Pointer Error Flag Mask */
#define SPI_SR_TXFPTEF(value)                 (SPI_SR_TXFPTEF_Msk & ((value) << SPI_SR_TXFPTEF_Pos))
#define SPI_SR_RXFPTEF_Pos                    _U_(31)                                              /**< (SPI_SR) Receive FIFO Pointer Error Flag Position */
#define SPI_SR_RXFPTEF_Msk                    (_U_(0x1) << SPI_SR_RXFPTEF_Pos)                     /**< (SPI_SR) Receive FIFO Pointer Error Flag Mask */
#define SPI_SR_RXFPTEF(value)                 (SPI_SR_RXFPTEF_Msk & ((value) << SPI_SR_RXFPTEF_Pos))
#define SPI_SR_Msk                            _U_(0xFF010F0F)                                      /**< (SPI_SR) Register Mask  */


/* -------- SPI_IER : (SPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define SPI_IER_RDRF_Pos                      _U_(0)                                               /**< (SPI_IER) Receive Data Register Full Interrupt Enable Position */
#define SPI_IER_RDRF_Msk                      (_U_(0x1) << SPI_IER_RDRF_Pos)                       /**< (SPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define SPI_IER_RDRF(value)                   (SPI_IER_RDRF_Msk & ((value) << SPI_IER_RDRF_Pos))  
#define SPI_IER_TDRE_Pos                      _U_(1)                                               /**< (SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Position */
#define SPI_IER_TDRE_Msk                      (_U_(0x1) << SPI_IER_TDRE_Pos)                       /**< (SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Mask */
#define SPI_IER_TDRE(value)                   (SPI_IER_TDRE_Msk & ((value) << SPI_IER_TDRE_Pos))  
#define SPI_IER_MODF_Pos                      _U_(2)                                               /**< (SPI_IER) Mode Fault Error Interrupt Enable Position */
#define SPI_IER_MODF_Msk                      (_U_(0x1) << SPI_IER_MODF_Pos)                       /**< (SPI_IER) Mode Fault Error Interrupt Enable Mask */
#define SPI_IER_MODF(value)                   (SPI_IER_MODF_Msk & ((value) << SPI_IER_MODF_Pos))  
#define SPI_IER_OVRES_Pos                     _U_(3)                                               /**< (SPI_IER) Overrun Error Interrupt Enable Position */
#define SPI_IER_OVRES_Msk                     (_U_(0x1) << SPI_IER_OVRES_Pos)                      /**< (SPI_IER) Overrun Error Interrupt Enable Mask */
#define SPI_IER_OVRES(value)                  (SPI_IER_OVRES_Msk & ((value) << SPI_IER_OVRES_Pos))
#define SPI_IER_NSSR_Pos                      _U_(8)                                               /**< (SPI_IER) NSS Rising Interrupt Enable Position */
#define SPI_IER_NSSR_Msk                      (_U_(0x1) << SPI_IER_NSSR_Pos)                       /**< (SPI_IER) NSS Rising Interrupt Enable Mask */
#define SPI_IER_NSSR(value)                   (SPI_IER_NSSR_Msk & ((value) << SPI_IER_NSSR_Pos))  
#define SPI_IER_TXEMPTY_Pos                   _U_(9)                                               /**< (SPI_IER) Transmission Registers Empty Enable Position */
#define SPI_IER_TXEMPTY_Msk                   (_U_(0x1) << SPI_IER_TXEMPTY_Pos)                    /**< (SPI_IER) Transmission Registers Empty Enable Mask */
#define SPI_IER_TXEMPTY(value)                (SPI_IER_TXEMPTY_Msk & ((value) << SPI_IER_TXEMPTY_Pos))
#define SPI_IER_UNDES_Pos                     _U_(10)                                              /**< (SPI_IER) Underrun Error Interrupt Enable Position */
#define SPI_IER_UNDES_Msk                     (_U_(0x1) << SPI_IER_UNDES_Pos)                      /**< (SPI_IER) Underrun Error Interrupt Enable Mask */
#define SPI_IER_UNDES(value)                  (SPI_IER_UNDES_Msk & ((value) << SPI_IER_UNDES_Pos))
#define SPI_IER_CMP_Pos                       _U_(11)                                              /**< (SPI_IER) Comparison Interrupt Enable Position */
#define SPI_IER_CMP_Msk                       (_U_(0x1) << SPI_IER_CMP_Pos)                        /**< (SPI_IER) Comparison Interrupt Enable Mask */
#define SPI_IER_CMP(value)                    (SPI_IER_CMP_Msk & ((value) << SPI_IER_CMP_Pos))    
#define SPI_IER_TXFEF_Pos                     _U_(24)                                              /**< (SPI_IER) TXFEF Interrupt Enable Position */
#define SPI_IER_TXFEF_Msk                     (_U_(0x1) << SPI_IER_TXFEF_Pos)                      /**< (SPI_IER) TXFEF Interrupt Enable Mask */
#define SPI_IER_TXFEF(value)                  (SPI_IER_TXFEF_Msk & ((value) << SPI_IER_TXFEF_Pos))
#define SPI_IER_TXFFF_Pos                     _U_(25)                                              /**< (SPI_IER) TXFFF Interrupt Enable Position */
#define SPI_IER_TXFFF_Msk                     (_U_(0x1) << SPI_IER_TXFFF_Pos)                      /**< (SPI_IER) TXFFF Interrupt Enable Mask */
#define SPI_IER_TXFFF(value)                  (SPI_IER_TXFFF_Msk & ((value) << SPI_IER_TXFFF_Pos))
#define SPI_IER_TXFTHF_Pos                    _U_(26)                                              /**< (SPI_IER) TXFTHF Interrupt Enable Position */
#define SPI_IER_TXFTHF_Msk                    (_U_(0x1) << SPI_IER_TXFTHF_Pos)                     /**< (SPI_IER) TXFTHF Interrupt Enable Mask */
#define SPI_IER_TXFTHF(value)                 (SPI_IER_TXFTHF_Msk & ((value) << SPI_IER_TXFTHF_Pos))
#define SPI_IER_RXFEF_Pos                     _U_(27)                                              /**< (SPI_IER) RXFEF Interrupt Enable Position */
#define SPI_IER_RXFEF_Msk                     (_U_(0x1) << SPI_IER_RXFEF_Pos)                      /**< (SPI_IER) RXFEF Interrupt Enable Mask */
#define SPI_IER_RXFEF(value)                  (SPI_IER_RXFEF_Msk & ((value) << SPI_IER_RXFEF_Pos))
#define SPI_IER_RXFFF_Pos                     _U_(28)                                              /**< (SPI_IER) RXFFF Interrupt Enable Position */
#define SPI_IER_RXFFF_Msk                     (_U_(0x1) << SPI_IER_RXFFF_Pos)                      /**< (SPI_IER) RXFFF Interrupt Enable Mask */
#define SPI_IER_RXFFF(value)                  (SPI_IER_RXFFF_Msk & ((value) << SPI_IER_RXFFF_Pos))
#define SPI_IER_RXFTHF_Pos                    _U_(29)                                              /**< (SPI_IER) RXFTHF Interrupt Enable Position */
#define SPI_IER_RXFTHF_Msk                    (_U_(0x1) << SPI_IER_RXFTHF_Pos)                     /**< (SPI_IER) RXFTHF Interrupt Enable Mask */
#define SPI_IER_RXFTHF(value)                 (SPI_IER_RXFTHF_Msk & ((value) << SPI_IER_RXFTHF_Pos))
#define SPI_IER_TXFPTEF_Pos                   _U_(30)                                              /**< (SPI_IER) TXFPTEF Interrupt Enable Position */
#define SPI_IER_TXFPTEF_Msk                   (_U_(0x1) << SPI_IER_TXFPTEF_Pos)                    /**< (SPI_IER) TXFPTEF Interrupt Enable Mask */
#define SPI_IER_TXFPTEF(value)                (SPI_IER_TXFPTEF_Msk & ((value) << SPI_IER_TXFPTEF_Pos))
#define SPI_IER_RXFPTEF_Pos                   _U_(31)                                              /**< (SPI_IER) RXFPTEF Interrupt Enable Position */
#define SPI_IER_RXFPTEF_Msk                   (_U_(0x1) << SPI_IER_RXFPTEF_Pos)                    /**< (SPI_IER) RXFPTEF Interrupt Enable Mask */
#define SPI_IER_RXFPTEF(value)                (SPI_IER_RXFPTEF_Msk & ((value) << SPI_IER_RXFPTEF_Pos))
#define SPI_IER_Msk                           _U_(0xFF000F0F)                                      /**< (SPI_IER) Register Mask  */


